Revit 2024 API
PipeFittingAndAccessoryPressureDropUIData Methods
The PipeFittingAndAccessoryPressureDropUIData type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetUIDataItems
 Gets all UI data items stored in the UI data.
GetUnits
 Gets units.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
PipeFittingAndAccessoryPressureDropUIData Class
Autodesk.Revit.UI.Plumbing Namespace